//***************************************************************************
//*                                                                         *
//*  volumehelp.cpp                                                         *
//*                                                                         *
//*  Author: YAMASHITA Katsuhiro                                            *
//*                                                                         *
//*  Create:  2022-04-02 created.                                           *
//*                                                                         *
//***************************************************************************
//
//  Copyright (C) YAMASHITA Katsuhiro. All rights reserved.
//  Licensed under the MIT License.
//
#include "stdafx.h"
#include "dllmain.h"
#include "volumehelp.h"
#include "win32wdkdef.h"
#include "ntvolumehelp.h"
#include "ntnativehelp.h"
#include "storagedevice.h"
using namespace STGCTL;

#define INITGUID
#include <guiddef.h>
#include <diskguid.h>

#ifdef __cplusplus
extern "C" {
#endif

#ifndef FILE_SUPPORTS_USN_JOURNAL
#define FILE_SUPPORTS_USN_JOURNAL           0x02000000  // winnt
#endif
#ifndef FILE_SUPPORTS_INTEGRITY_STREAMS
#define FILE_SUPPORTS_INTEGRITY_STREAMS     0x04000000  // winnt
#endif

//////////////////////////////////////////////////////////////////////////////

typedef struct _FS_VOLUME_ATTIBUTE_DESCRIPTION
{
	ULONG Flag;
	PCWSTR Name;
} FS_VOLUME_ATTIBUTE_DESCRIPTION;

#define _FS_VOLUME_ATTIBUTE_DESCRIPTION(f)  { f, L#f }

FS_VOLUME_ATTIBUTE_DESCRIPTION attrDesc[] = {
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_CASE_SENSITIVE_SEARCH ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_CASE_PRESERVED_NAMES ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_UNICODE_ON_DISK ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_PERSISTENT_ACLS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_READ_ONLY_VOLUME ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_VOLUME_IS_COMPRESSED ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_RETURNS_CLEANUP_RESULT_INFO ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_DAX_VOLUME ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_NAMED_STREAMS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_OBJECT_IDS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_FILE_COMPRESSION ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_ENCRYPTION ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_TRANSACTIONS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_EXTENDED_ATTRIBUTES ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_OPEN_BY_FILE_ID ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_HARD_LINKS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_REPARSE_POINTS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SEQUENTIAL_WRITE_ONCE ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_USN_JOURNAL ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_VOLUME_QUOTAS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_SPARSE_FILES ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_REMOTE_STORAGE ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_INTEGRITY_STREAMS ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_POSIX_UNLINK_RENAME ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_SPARSE_VDL ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_GHOSTING ),
	_FS_VOLUME_ATTIBUTE_DESCRIPTION( FILE_SUPPORTS_BLOCK_REFCOUNTING ),
};

BOOL GetVolumeAttributeFlag(int iIndex,DWORD *pdwFlag)
{
	if( iIndex < 0 || iIndex >= _countof(attrDesc) )
		return FALSE;

	if( pdwFlag == NULL )
		return FALSE;

	*pdwFlag = attrDesc[iIndex].Flag;

	return TRUE;
}

int	WINAPI GetVolumeAttributeString(int iIndex,PWSTR psz,DWORD cch)
{
	if( iIndex < 0 || iIndex >= _countof(attrDesc) )
		return 0;

	if( psz == NULL )
		return 0;

	StringCchCopy(psz,cch,attrDesc[iIndex].Name);

	return (int)wcslen(psz);
}

//////////////////////////////////////////////////////////////////////////////

typedef struct _FS_FS_DEVICE_CHARACTERISTICS_NAME
{
	ULONG Flag;
	PWSTR Name;
} FS_DEVICE_CHARACTERISTICS_NAME;

#define _DEF_FS_DEVICE_CHARACTERISTICS_ITEM(f)  { f, L#f  }

FS_DEVICE_CHARACTERISTICS_NAME DeviceCharacteristics[] = {
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_DEVICE_IS_MOUNTED ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_REMOVABLE_MEDIA ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_READ_ONLY_DEVICE ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_WRITE_ONCE_MEDIA ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_PORTABLE_DEVICE ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_REMOTE_DEVICE ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_FLOPPY_DISKETTE ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_VIRTUAL_VOLUME ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_AUTOGENERATED_DEVICE_NAME ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_DEVICE_SECURE_OPEN ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_CHARACTERISTIC_PNP_DEVICE ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_CHARACTERISTIC_TS_DEVICE ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_CHARACTERISTIC_WEBDAV_DEVICE ),
	_DEF_FS_DEVICE_CHARACTERISTICS_ITEM( FILE_DEVICE_ALLOW_APPCONTAINER_TRAVERSAL ),
};

BOOL WINAPI GetDeviceCharacteristicsFlag(int iIndex,DWORD *pdwFlag)
{
	if( iIndex < 0 || iIndex >= _countof(DeviceCharacteristics) )
		return FALSE;

	if( pdwFlag == NULL )
		return FALSE;

	*pdwFlag = DeviceCharacteristics[iIndex].Flag;

	return TRUE;
}

INT	WINAPI GetDeviceCharacteristicsString(int iIndex,PWSTR psz,DWORD cch)
{
	if( iIndex < 0 || iIndex >= _countof(attrDesc) )
		return 0;

	if( psz == NULL )
		return 0;

	StringCchCopy(psz,cch,DeviceCharacteristics[iIndex].Name);

	return (int)wcslen(psz);
}

//////////////////////////////////////////////////////////////////////////////

typedef struct _FS_FILE_DEVICE_TYPE_NAME
{
	ULONG DeviceType;
	WCHAR *DeviceTypeName;
} FS_FILE_DEVICE_TYPE_NAME;

#define DEVICE_TYPE_DEF(x)  {x, L#x}

#define FILE_DEVICE_MT_COMPOSITE        0x00000042
#define FILE_DEVICE_MT_TRANSPORT        0x00000043
#define FILE_DEVICE_BIOMETRIC	        0x00000044
#define FILE_DEVICE_PMI                 0x00000045

FS_FILE_DEVICE_TYPE_NAME g_DeviceType[] = 
{
	DEVICE_TYPE_DEF( FILE_DEVICE_BEEP ),
	DEVICE_TYPE_DEF( FILE_DEVICE_CD_ROM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_CD_ROM_FILE_SYSTEM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_CONTROLLER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_DATALINK ),
	DEVICE_TYPE_DEF( FILE_DEVICE_DFS ),
	DEVICE_TYPE_DEF( FILE_DEVICE_DISK ),
	DEVICE_TYPE_DEF( FILE_DEVICE_DISK_FILE_SYSTEM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_FILE_SYSTEM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_INPORT_PORT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_KEYBOARD ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MAILSLOT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MIDI_IN ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MIDI_OUT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MOUSE ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MULTI_UNC_PROVIDER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_NAMED_PIPE ),
	DEVICE_TYPE_DEF( FILE_DEVICE_NETWORK ),
	DEVICE_TYPE_DEF( FILE_DEVICE_NETWORK_BROWSER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_NETWORK_FILE_SYSTEM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_NULL ),
	DEVICE_TYPE_DEF( FILE_DEVICE_PARALLEL_PORT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_PHYSICAL_NETCARD ),
	DEVICE_TYPE_DEF( FILE_DEVICE_PRINTER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SCANNER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SERIAL_MOUSE_PORT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SERIAL_PORT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SCREEN ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SOUND ),
	DEVICE_TYPE_DEF( FILE_DEVICE_STREAMS ),
	DEVICE_TYPE_DEF( FILE_DEVICE_TAPE ),
	DEVICE_TYPE_DEF( FILE_DEVICE_TAPE_FILE_SYSTEM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_TRANSPORT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_UNKNOWN ),
	DEVICE_TYPE_DEF( FILE_DEVICE_VIDEO ),
	DEVICE_TYPE_DEF( FILE_DEVICE_VIRTUAL_DISK ),
	DEVICE_TYPE_DEF( FILE_DEVICE_WAVE_IN ),
	DEVICE_TYPE_DEF( FILE_DEVICE_WAVE_OUT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_8042_PORT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_NETWORK_REDIRECTOR ),
	DEVICE_TYPE_DEF( FILE_DEVICE_BATTERY ),
	DEVICE_TYPE_DEF( FILE_DEVICE_BUS_EXTENDER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MODEM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_VDM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MASS_STORAGE ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SMB ),
	DEVICE_TYPE_DEF( FILE_DEVICE_KS ),
	DEVICE_TYPE_DEF( FILE_DEVICE_CHANGER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SMARTCARD ),
	DEVICE_TYPE_DEF( FILE_DEVICE_ACPI ),
	DEVICE_TYPE_DEF( FILE_DEVICE_DVD ),
	DEVICE_TYPE_DEF( FILE_DEVICE_FULLSCREEN_VIDEO ),
	DEVICE_TYPE_DEF( FILE_DEVICE_DFS_FILE_SYSTEM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_DFS_VOLUME ),
	DEVICE_TYPE_DEF( FILE_DEVICE_SERENUM ),
	DEVICE_TYPE_DEF( FILE_DEVICE_TERMSRV ),
	DEVICE_TYPE_DEF( FILE_DEVICE_KSEC ),
	DEVICE_TYPE_DEF( FILE_DEVICE_FIPS ),
	DEVICE_TYPE_DEF( FILE_DEVICE_INFINIBAND ),
	DEVICE_TYPE_DEF( FILE_DEVICE_VMBUS ),
	DEVICE_TYPE_DEF( FILE_DEVICE_CRYPT_PROVIDER ),
	DEVICE_TYPE_DEF( FILE_DEVICE_WPD ),
	DEVICE_TYPE_DEF( FILE_DEVICE_BLUETOOTH ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MT_COMPOSITE ),
	DEVICE_TYPE_DEF( FILE_DEVICE_MT_TRANSPORT ),
	DEVICE_TYPE_DEF( FILE_DEVICE_BIOMETRIC ),
	DEVICE_TYPE_DEF( FILE_DEVICE_PMI )
};

int GetDeviceTypeString(DWORD DeviceType,PWSTR pszText,int cchTextMax)
{
	if( DeviceType != 0 && DeviceType <= _countof(g_DeviceType) )
	{
		StringCchCopy(pszText,cchTextMax,g_DeviceType[ DeviceType - 1 ].DeviceTypeName);
		return (int)wcslen(pszText);
	}
	return 0;
}

LPCWSTR WINAPI GetPartitionStyleText(LONG PartitionStyle)
{
	switch( PartitionStyle )
	{
		case PARTITION_STYLE_MBR:
			return L"MBR";
		case PARTITION_STYLE_GPT:
			return L"GPT";
		case PARTITION_STYLE_RAW:
			return L"RAW";
	}

	return L"???";
}

LPCWSTR WINAPI GetPartitionTypeText(LONG PartitionType)
{
	switch( PartitionType & ~VALID_NTFT ) // ~0xC0
	{
		case PARTITION_ENTRY_UNUSED:
			return L"UNUSED"; // 0x00 An unused entry partition.
 
		case PARTITION_EXTENDED:
			return L"EXTENDED"; // 0x05 An extended partition.
 
		case PARTITION_FAT_12:
			return L"FAT12"; // 0x01 A FAT12 file system partition.
 
		case PARTITION_FAT_16:
			return L"FAT16"; // 0x04 A FAT16 file system partition.
 
		case PARTITION_FAT32:
			return L"FAT32"; // 0x0B A FAT32 file system partition.
 
		case PARTITION_FAT32_XINT13:
			return L"FAT32 XINT13"; // 0x0C FAT32 using extended int13 services

		case PARTITION_IFS:
			return L"IFS"; // 0x07 An IFS partition.
 
		case PARTITION_LDM:
			return L"LDM"; // 0x42 A logical disk manager (LDM) partition.
 
		case PARTITION_NTFT:
			return L"NTFT"; // 0x80 An NTFT partition.
 
		case VALID_NTFT:
			return L"NTFT"; // 0xC0 A valid NTFT partition.

		case PARTITION_HUGE:
			return L"HUGE"; // 0x06 Huge partition MS-DOS V4

		case PARTITION_PREP:
			return L"PREP";  // 0x41 PowerPC Reference Platform (PReP) Boot Partition

		case PARTITION_OS2BOOTMGR:
			return L"OS2";  // 0x0A  OS/2 Boot Manager/OPUS/Coherent swap

		case PARTITION_XINT13:
			return L"XINT13"; // 0x0E Win95 partition using extended int13 services

		case PARTITION_XINT13_EXTENDED:
			return L"XINT13_EXTENDED"; //  0x0F Same as type 5 but uses extended int13 services

		case PARTITION_XENIX_1:
			return L"XENIX1"; // 0x02 Xenix

		case PARTITION_XENIX_2:
			return L"XENIX2"; // 0x02 Xenix

		case PARTITION_UNIX:
			return L"UNIX"; // 0x63 Unix

		case 0x27:
			// Set CreatePartitionType to Primary, and then set ModifyPartition<code>TypeID to 0x27.
			// Recovery files such as push-button recovery images and other system utilities.
			return L"RECOVERY/UTIL";

		case 0x12:
		case 0x84:
		case 0xDE:
		case 0xFE:
		case 0xA0:
			return L"OEM";
	}
	return L"???";
}

EXTERN_C PWSTR WINAPI GetGPTPartitionTypeString( GUID& Guid, LPWSTR pszBuf, int cchBuf )
{
	if( IsEqualGUID(PARTITION_BASIC_DATA_GUID,Guid) )
	{
		return L"PARTITION_BASIC_DATA_GUID";
	}
	if( IsEqualGUID(PARTITION_ENTRY_UNUSED_GUID,Guid) )
	{
		return L"PARTITION_ENTRY_UNUSED_GUID";
	}
	if( IsEqualGUID(PARTITION_SYSTEM_GUID,Guid) )
	{
		return L"PARTITION_SYSTEM_GUID";
	}
	if( IsEqualGUID(PARTITION_MSFT_RESERVED_GUID,Guid) )
	{
		return L"PARTITION_MSFT_RESERVED_GUID";
	}
	if( IsEqualGUID(PARTITION_LDM_METADATA_GUID,Guid) )
	{
		return L"PARTITION_LDM_METADATA_GUID";
	}
	if( IsEqualGUID(PARTITION_LDM_DATA_GUID,Guid) )
	{
